wrk8/wrk_6003_r_Heavy.txt
wrk -t 3 -c 3 -d180 -R 50 -math 0 --latency http://13.0.0.29:8081/high/web350m.html
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.61m    49.29s    2.95m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    89718.78 ms
 75.000%    139591.68 ms
 90.000%    162136.06 ms
 99.000%    177078.27 ms
 99.900%    177078.27 ms
 99.990%    177078.27 ms
 99.999%    177078.27 ms
100.000%    177078.27 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   16809.983     0.000000            1         1.00
   29179.903     0.100000            2         1.11
   41418.751     0.200000            3         1.25
   66224.127     0.300000            5         1.43
   77463.551     0.400000            6         1.67
   89718.783     0.500000            7         2.00
  103350.271     0.550000            8         2.22
  115605.503     0.600000            9         2.50
  127401.983     0.650000           10         2.86
  127401.983     0.700000           10         3.33
  139591.679     0.750000           11         4.00
  139591.679     0.775000           11         4.44
  150732.799     0.800000           12         5.00
  150732.799     0.825000           12         5.71
  150732.799     0.850000           12         6.67
  162136.063     0.875000           13         8.00
  162136.063     0.887500           13         8.89
  162136.063     0.900000           13        10.00
  162136.063     0.912500           13        11.43
  162136.063     0.925000           13        13.33
  177078.271     0.937500           14        16.00
  177078.271     1.000000           14          inf
#[Mean    =    96421.010, StdDeviation   =    49290.693]
#[Max     =   176947.200, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    9986.05 ms
 75.000%    10477.57 ms
 90.000%    12697.60 ms
 99.000%    16809.98 ms
 99.900%    16809.98 ms
 99.990%    16809.98 ms
 99.999%    16809.98 ms
100.000%    16809.98 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9871.359     0.000000            1         1.00
    9912.319     0.100000            2         1.11
    9936.895     0.200000            3         1.25
    9977.855     0.300000            5         1.43
    9986.047     0.400000            7         1.67
    9986.047     0.500000            7         2.00
   10002.431     0.550000            9         2.22
   10002.431     0.600000            9         2.50
   10313.727     0.650000           10         2.86
   10313.727     0.700000           10         3.33
   10477.567     0.750000           11         4.00
   10477.567     0.775000           11         4.44
   12394.495     0.800000           12         5.00
   12394.495     0.825000           12         5.71
   12394.495     0.850000           12         6.67
   12697.599     0.875000           13         8.00
   12697.599     0.887500           13         8.89
   12697.599     0.900000           13        10.00
   12697.599     0.912500           13        11.43
   12697.599     0.925000           13        13.33
   16809.983     0.937500           14        16.00
   16809.983     1.000000           14          inf
#[Mean    =    10876.928, StdDeviation   =     1867.398]
#[Max     =    16793.600, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14 requests in 3.03m, 4.85GB read
  Socket errors: connect 0, read 0, write 0, timeout 70
Requests/sec:      0.08
Transfer/sec:     27.37MB
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.55m    48.35s    2.85m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    87883.77 ms
 75.000%    135659.52 ms
 90.000%    158728.19 ms
 99.000%    171048.96 ms
 99.900%    171048.96 ms
 99.990%    171048.96 ms
 99.999%    171048.96 ms
100.000%    171048.96 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   14237.695     0.000000            1         1.00
   26902.527     0.100000            2         1.11
   39288.831     0.200000            3         1.25
   64159.743     0.300000            5         1.43
   75563.007     0.400000            6         1.67
   87883.775     0.500000            7         2.00
   99221.503     0.550000            8         2.22
  111476.735     0.600000            9         2.50
  123207.679     0.650000           10         2.86
  123207.679     0.700000           10         3.33
  135659.519     0.750000           11         4.00
  135659.519     0.775000           11         4.44
  147062.783     0.800000           12         5.00
  147062.783     0.825000           12         5.71
  147062.783     0.850000           12         6.67
  158728.191     0.875000           13         8.00
  158728.191     0.887500           13         8.89
  158728.191     0.900000           13        10.00
  158728.191     0.912500           13        11.43
  158728.191     0.925000           13        13.33
  171048.959     0.937500           14        16.00
  171048.959     1.000000           14          inf
#[Mean    =    93268.553, StdDeviation   =    48354.634]
#[Max     =   170917.888, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    10076.16 ms
 75.000%    10354.69 ms
 90.000%    10403.84 ms
 99.000%    14237.69 ms
 99.900%    14237.69 ms
 99.990%    14237.69 ms
 99.999%    14237.69 ms
100.000%    14237.69 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9936.895     0.000000            1         1.00
    9945.087     0.100000            2         1.11
    9994.239     0.200000            4         1.25
   10051.583     0.300000            5         1.43
   10059.775     0.400000            6         1.67
   10076.159     0.500000            7         2.00
   10117.119     0.550000            8         2.22
   10190.847     0.600000            9         2.50
   10223.615     0.650000           10         2.86
   10223.615     0.700000           10         3.33
   10354.687     0.750000           11         4.00
   10354.687     0.775000           11         4.44
   10379.263     0.800000           12         5.00
   10379.263     0.825000           12         5.71
   10379.263     0.850000           12         6.67
   10403.839     0.875000           13         8.00
   10403.839     0.887500           13         8.89
   10403.839     0.900000           13        10.00
   10403.839     0.912500           13        11.43
   10403.839     0.925000           13        13.33
   14237.695     0.937500           14        16.00
   14237.695     1.000000           14          inf
#[Mean    =    10421.979, StdDeviation   =     1067.991]
#[Max     =    14229.504, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14 requests in 3.03m, 5.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 71
Requests/sec:      0.08
Transfer/sec:     28.55MB
Running 3m test @ http://13.0.0.29:8081/high/web350m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49m    48.88s    2.81m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    83886.08 ms
 75.000%    131203.07 ms
 90.000%    156368.89 ms
 99.000%    168558.59 ms
 99.900%    168558.59 ms
 99.990%    168558.59 ms
 99.999%    168558.59 ms
100.000%    168558.59 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10534.911     0.000000            1         1.00
   22773.759     0.100000            2         1.11
   35061.759     0.200000            3         1.25
   59506.687     0.300000            5         1.43
   70844.415     0.400000            6         1.67
   83886.079     0.500000            7         2.00
   95289.343     0.550000            8         2.22
  107610.111     0.600000            9         2.50
  118882.303     0.650000           10         2.86
  118882.303     0.700000           10         3.33
  131203.071     0.750000           11         4.00
  131203.071     0.775000           11         4.44
  144965.631     0.800000           12         5.00
  144965.631     0.825000           12         5.71
  144965.631     0.850000           12         6.67
  156368.895     0.875000           13         8.00
  156368.895     0.887500           13         8.89
  156368.895     0.900000           13        10.00
  156368.895     0.912500           13        11.43
  156368.895     0.925000           13        13.33
  168558.591     0.937500           14        16.00
  168558.591     1.000000           14          inf
#[Mean    =    89455.762, StdDeviation   =    48876.039]
#[Max     =   168427.520, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    10010.62 ms
 75.000%    10125.31 ms
 90.000%    10780.67 ms
 99.000%    12410.88 ms
 99.900%    12410.88 ms
 99.990%    12410.88 ms
 99.999%    12410.88 ms
100.000%    12410.88 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9879.551     0.000000            1         1.00
    9936.895     0.100000            3         1.11
    9936.895     0.200000            3         1.25
    9977.855     0.300000            5         1.43
   10010.623     0.400000            7         1.67
   10010.623     0.500000            7         2.00
   10027.007     0.550000            8         2.22
   10035.199     0.600000           10         2.50
   10035.199     0.650000           10         2.86
   10035.199     0.700000           10         3.33
   10125.311     0.750000           11         4.00
   10125.311     0.775000           11         4.44
   10526.719     0.800000           12         5.00
   10526.719     0.825000           12         5.71
   10526.719     0.850000           12         6.67
   10780.671     0.875000           13         8.00
   10780.671     0.887500           13         8.89
   10780.671     0.900000           13        10.00
   10780.671     0.912500           13        11.43
   10780.671     0.925000           13        13.33
   12410.879     0.937500           14        16.00
   12410.879     1.000000           14          inf
#[Mean    =    10256.969, StdDeviation   =      643.020]
#[Max     =    12402.688, Total count    =           14]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15 requests in 3.04m, 5.13GB read
  Socket errors: connect 0, read 0, write 0, timeout 69
Requests/sec:      0.08
Transfer/sec:     28.80MB